tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf2525_tdd.h
#define LVDL2                         522
#define HLVDL3                        523
#define LVV3                          524
#define LVDL3                         525
#define HLVDEN                        526
#define LVDEN                         527
#define BGST                          528
#define IRVST                         529
#define IVRST                         530
#define VDIRMAG                       531
#define OSCCON                        532
#define SCS0                          533
#define SCS                           534
#define SCS1                          535
#define FLTS                          536
#define IOFS                          537
#define OSTS                          538
#define IRCF                          539
#define IRCF0                         540
#define IRCF1                         541
#define IRCF2                         542
#define IDLEN                         543
#define T0CON                         544
#define T0PS                          545
#define T0PS0                         546
#define T0PS1                         547
#define T0PS2                         548
#define PSA                           549
#define T0SE                          550
#define T0CS                          551
#define T08BIT                        552
#define T016BIT                       553
#define TMR0ON                        554
#define STATUS                        555
#define C                             556
#define CARRY                         557
#define DC                            558
#define ZERO                          559
#define Z                             560
#define OV                            561
#define OVERFLOW                      562
#define N                             563
#define NEGATIVE                      564
#define INTCON3                       565
#define INT1IF                        566
#define INT1F                         567
#define INT2IF                        568
#define INT2F                         569
#define INT1E                         570
#define INT1IE                        571
#define INT2IE                        572
#define INT2E                         573
#define INT1P                         574
#define INT1IP                        575
#define INT2IP                        576
#define INT2P                         577
#define INTCON2                       578
#define RBIP                          579
#define TMR0IP                        580
#define INTEDG2                       581
#define INTEDG1                       582
#define INTEDG0                       583
#define RBPU                          584
#define NOT_RBPU                      585
#define nRBPU                         586
#define INTCON                        587
#define RBIF                          588
#define INT0F                         589
#define INT0IF                        590
#define T0IF                          591
#define TMR0IF                        592
#define RBIE                          593
#define INT0E                         594
#define INT0IE                        595
#define T0IE                          596
#define TMR0IE                        597
#define PEIE                          598
#define PEIE_GIEL                     599
#define GIEL                          600
#define GIE_GIEH                      601
#define GIE                           602
#define GIEH                          603
#define STKPTR0                       604
#define STKPTR                        605
#define SP0                           606
#define STKPTR1                       607
#define SP1                           608
#define STKPTR2                       609
#define SP2                           610
#define SP3                           611
#define STKPTR3                       612
#define STKPTR4                       613
#define SP4                           614
#define STKUNF                        615
#define STKOVF                        616
#define STKFUL                        617

#endif // _PIC18LF2525_H_
